{"data":{"markdownRemark":{"html":"<h1>0.7 (March 26, 2019)</h1>\n<p>This release continues to build on the <code>0.x</code> release with bug fixes, improvements, and new features.</p>\n<blockquote>\n<p>Note: This will be the last release from the 0.x branch of Hyperspace. Future versions of hyperspace will be released and maintained on <a href=\"https://github.com/hyperspacedev/hyperspace\">hyperspacedev/hyperspace</a>, which sports a brand new design and many more features to come.</p>\n</blockquote>\n<h2>New features</h2>\n<ul>\n<li>Get your vote on! The new polls feature from Mastodon has been added to Hyperspace. Create and vote on polls from any post.</li>\n<li>Express yourself with custom emojis! The emoji picker now brings in custom emojis from your server and posts will render custom emojis. 🙌</li>\n<li>Make posts faster with new Keyboard Shortcuts! Press 'N' on the home screen to open the composer. More keyboard shortcuts are found in the compose window.</li>\n</ul>\n<h2>Improvements</h2>\n<ul>\n<li>The carousel has been redesigned so that it remains a certain size, but images will still look nice.</li>\n<li>More loaders have been placed in. This should reduce ambiguity in many places.</li>\n<li>The composer has been completely overhauled with better image uploads (and new description support for screen readers and tooltips), emoji picker, visibility settings as a dropdown, warning system, and more.</li>\n<li>The reply window now displays the full HTML contents of a post and uses the same element from the composer.</li>\n<li>The composer at the top has been replaced with a compose button at the bottom of the window for quick access anywhere.</li>\n<li>Boost cards have a slight redesign that shows the full content and displays a regular tooltip.</li>\n<li>Images on posts have descriptions displayed on hover as a tooltip.</li>\n<li>Hyperspace's top bar is now visible at all times and is slimmer than before.</li>\n</ul>\n<h2>Developer changes</h2>\n<ul>\n<li>The <code>Composable</code> element has been introduced as a means of making new elements that create or reply to posts. This is the basis for the Composer and the reply window.</li>\n<li><strong>This marks the last release of the 0.x series. Further developments are on the main hyperspace repository.</strong></li>\n</ul>\n<h2>Bug fixes</h2>\n<ul>\n<li>Clicking the link to an image in the composer no longer makes the desktop app unusable.</li>\n<li>Grammarly has been disabled on the composer textarea to prevent collisions with Grammarly and the composer's state.</li>\n<li>The post date element now says via 'determination (unknown)' when the application isn't known.</li>\n</ul>\n<h1>0.6.1 (March 9, 2019)</h1>\n<p>This hotfix update fixes a bug that occurred after logging in and viewing the app, causing the page to go blank because it couldn't fetch account data.</p>\n<p>This update still contains the features and improvements found in version 0.6.0.</p>\n<h1>0.6 (March 9, 2019)</h1>\n<h1>0.5</h1>\n<h1>0.4</h1>\n<h1>0.3</h1>\n<h1>0.2</h1>\n<h1>0.1</h1>","frontmatter":{"title":"What's new in Hyperspace","path":"/docs/whats-new","description":"Read about the latest changes to Hyperspace."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"pathSlug":"/docs/whats-new"}}