{"data":{"markdownRemark":{"html":"<h1>1.0.0beta5 (May 24, 2019)</h1>\n<p>What's new:</p>\n<ul>\n<li>Source code introduces a new <a href=\"https://github.com/hyperspacedev/hyperspace/blob/master/patreon.md\">Patreon contributors</a> list (#59)</li>\n<li>Fixes an issue with the search functionality on the desktop apps (fixes #60)</li>\n<li>Media cards should be shorter in description length and hide images when necessary (fixes #47)</li>\n</ul>\n<hr>\n<h1>1.0.0beta4 (May 17, 2019)</h1>\n<p>What's new:</p>\n<ul>\n<li>\n<p>Introduces new instance and app cards on the about page to better organize info (fixes #46)</p>\n<ul>\n<li>Instance card includes options to invite a new user, view terms of service, etc.</li>\n</ul>\n</li>\n<li>Refines control on federation settings, including public timelines, universal login, and default visibilities (fixes #50)</li>\n<li>\n<p>Introduces code to build the new desktop apps that support the following (#52):</p>\n<ul>\n<li>New login system supported by <code>hyperspace://</code> protocol</li>\n<li>Themes and dark mode fully supported in macOS (#55)</li>\n<li>Links that try to open in a new window (using <code>target=\"_blank\"</code>) opens in default browser</li>\n<li>Includes build instructions for the desktop</li>\n</ul>\n</li>\n<li>Includes Azure Pipelines code that tests building process</li>\n</ul>\n<hr>\n<h1>1.0.0beta3 (May 3, 2019)</h1>\n<p>What's new:</p>\n<ul>\n<li>\n<p>Login screen changes include a new version string and a fixed Authorize button (fixes #24).</p>\n<ul>\n<li>Changes login text from \"If you are from X\" to \"Not from X?\".</li>\n</ul>\n</li>\n<li>\n<p>Enforce stricter rules on when an instance is defederated in config.json (fixes #28):</p>\n<ul>\n<li>Default visibility changes from public to unlisted and cannot be changed to public in settings.</li>\n<li>Login page only allows to log in to instance from <code>registerBase</code>.</li>\n</ul>\n</li>\n<li>\n<p>Makes updates to CSS and themes:</p>\n<ul>\n<li>Fix narrow margins on mobile devices (fixes #27).</li>\n<li>Remove the Royal II (King) theme and replace with Classic theme.</li>\n<li>Update colors for Attract theme to prevent CSS collisions (fixes #26).</li>\n<li>Settings menu includes new icons for clarity and ease-of-discoverability (fix #30).</li>\n</ul>\n</li>\n<li>Brand name is applied to more places in Hyperspace and changes Hyperspace app name in login process (fixes #34).</li>\n<li>Addresses issue where media upload snackbars didn't dismiss properly (fixes #32).</li>\n<li>Adds a Settings menu for editing profiles within Hyperspace and a new page at <code>/you</code> to edit a user's avatar, header, display name, and bio (fixes #14).</li>\n</ul>\n<hr>\n<h1>1.0.0beta2u2 (April 26, 2019)</h1>\n<p>What's new:</p>\n<ul>\n<li>Changes the login function in the emergency mode from <code>createHyperspaceApp</code> to <code>Mastodon.registerApp</code> (pulled from <a href=\"https://github.com/gopherdonapp/app\">@gopherdonapp/app</a>).</li>\n<li>Fixes the <code>createHyperspaceApp</code> function so that when it calls the <code>createApp</code> function, it passes the base URL from the parameters (required to make an app on the server with base URL) (fixes #8, noted by @GidiKroon).</li>\n<li>Fixes the bug where the app crashes when clicking \"Load more posts\" on a profile with no posts (fixes #13).</li>\n<li>Makes avatars in applicable areas clickable, redirecting to the profile page of an account.</li>\n<li>Adds a 'View profile' button as an action in a notification (fixes #15).</li>\n<li>Changes the default profile icon to <code>AssignmentIndIcon</code> for consistency.</li>\n<li>Adds streaming to notification page so new notifications are loaded in while on the page (fixes #19)</li>\n<li>Adds a reply button to notifications that are of the type mention (eg. messages, replies to existing posts, new posts with a mention, etc.)</li>\n<li>Fixes bug where boosting/unboosting a post doesn't update its state</li>\n<li>updates version to <code>1.0.0beta2u2</code></li>\n</ul>\n<hr>\n<h1>1.0.0beta2u1 (April 24, 2019)</h1>\n<p>What's new:</p>\n<ul>\n<li>A backup method for authenticating has been implemented that works similar to the <code>hyperspace-classic</code> method.</li>\n<li>The view thread button now corresponds to the actual post if it's a reblog.</li>\n</ul>\n<hr>\n<blockquote>\n<p>Note: This document covers the latest features, bug fixes, and improvements deployed to the beta versions of Hyperspace, available at <a href=\"https://hyperspaceapp-net.herokuapp.com\">https://hyperspacepapp-net.herokuapp.com</a> and other instances that are deployed on the beta channel.</p>\n</blockquote>\n<h1>1.0.0beta2 (April 22, 2019)</h1>\n<blockquote>\n<p>Update: this beta has been re-released due to an infinite state error that cause the 404 page to not work properly. The 404 page in question has been disabled for this release.</p>\n</blockquote>\n<p>What's new:</p>\n<ul>\n<li>A new <code>location</code> field in the config file should help mitigate redirect URL issues that cause client authentication errors. (#8)</li>\n<li>The notification badge will now be displayed on mobile devices in the menu and should no longer disappear and lose count with the setting \"Notification badge counts all notifications'' turned on (fixes #7).</li>\n<li>The theme chooser has been slightly redesigned to include a new theme preview before applying the theme.</li>\n<li>A new setting is available to set the default visibility when composing new posts.</li>\n<li>The drawer menu on mobile devices has been reorganized in a logical manner.</li>\n<li>A new setting that allows the app to follow the browser's/platform's light mode/dark mode preference has been added.</li>\n<li>\n<p>A few changes have been made to themes in general:</p>\n<ul>\n<li>The 'Brother' and 'Scientist' themes have been removed.</li>\n<li>Most existing themes have been renamed.</li>\n<li>Two new themes, Bliss and Attract, have been added.</li>\n</ul>\n</li>\n<li>The 'Who to follow' page link has been enabled.</li>\n<li>A new recommendations page is available to follow suggested accounts and manage follow requests.</li>\n<li><del>A new '404' page has been added.</del></li>\n</ul>\n<hr>\n<h1>1.0.0beta1u1 (April 21, 2019)</h1>\n<ul>\n<li>The notifications toggle bug where it switches states after reloading because the user denied permission to display notifications has been fixed. (fixes #2)</li>\n<li>A new notification setting lets you display all notifications in the badge or just the new ones during that session (fixes #3).</li>\n<li>The app and website icons for Hyperspace have been reinstated (fixes #5).</li>\n<li>\n<p>Padding for posts and content has been better optimized for smaller devices and the toolbar has been simplified so that it only shows 'Favorite', 'Boost', and 'Reply' on mobile. (fixes #4).</p>\n<ul>\n<li>This change also puts the 'View thread' and 'Open in Web' buttons in the menu when on a mobile device.</li>\n</ul>\n</li>\n</ul>\n<hr>\n<h1>1.0.0beta1 (April 12?, 2018)</h1>\n<ul>\n<li>First release of the <code>1.x</code> series of Hyperspace.</li>\n</ul>","frontmatter":{"title":"What's new in Hyperspace Beta","path":"/docs/whats-new-beta","description":"Read about the latest features, improvements, changes, and bug fixes coming to Hyperspace (currently in beta)."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"pathSlug":"/docs/whats-new-beta"}}