{"data":{"markdownRemark":{"html":"<h1>1.0.0beta2u2 (April 26, 2018)</h1>\n<hr>\n<h1>1.0.0beta2u1 (April 24, 2019)</h1>\n<p>What's new:</p>\n<ul>\n<li>A backup method for authenticating has been implemented that works similar to the <code>hyperspace-classic</code> method.</li>\n<li>The view thread button now corresponds to the actual post if it's a reblog.</li>\n</ul>\n<hr>\n<blockquote>\n<p>Note: This document covers the latest features, bug fixes, and improvements deployed to the beta versions of Hyperspace, available at <a href=\"https://hyperspaceapp-net.herokuapp.com\">https://hyperspacepapp-net.herokuapp.com</a> and other instances that are deployed on the beta channel.</p>\n</blockquote>\n<h1>1.0.0beta2 (April 22, 2019)</h1>\n<blockquote>\n<p>Update: this beta has been re-released due to an infinite state error that cause the 404 page to not work properly. The 404 page in question has been disabled for this release.</p>\n</blockquote>\n<p>What's new:</p>\n<ul>\n<li>A new <code>location</code> field in the config file should help mitigate redirect URL issues that cause client authentication errors. (#8)</li>\n<li>The notification badge will now be displayed on mobile devices in the menu and should no longer disappear and lose count with the setting \"Notification badge counts all notifications'' turned on (fixes #7).</li>\n<li>The theme chooser has been slightly redesigned to include a new theme preview before applying the theme.</li>\n<li>A new setting is available to set the default visibility when composing new posts.</li>\n<li>The drawer menu on mobile devices has been reorganized in a logical manner.</li>\n<li>A new setting that allows the app to follow the browser's/platform's light mode/dark mode preference has been added.</li>\n<li>\n<p>A few changes have been made to themes in general:</p>\n<ul>\n<li>The 'Brother' and 'Scientist' themes have been removed.</li>\n<li>Most existing themes have been renamed.</li>\n<li>Two new themes, Bliss and Attract, have been added.</li>\n</ul>\n</li>\n<li>The 'Who to follow' page link has been enabled.</li>\n<li>A new recommendations page is available to follow suggested accounts and manage follow requests.</li>\n<li><del>A new '404' page has been added.</del></li>\n</ul>\n<hr>\n<h1>1.0.0beta1u1 (April 21, 2019)</h1>\n<ul>\n<li>The notifications toggle bug where it switches states after reloading because the user denied permission to display notifications has been fixed. (fixes #2)</li>\n<li>A new notification setting lets you display all notifications in the badge or just the new ones during that session (fixes #3).</li>\n<li>The app and website icons for Hyperspace have been reinstated (fixes #5).</li>\n<li>\n<p>Padding for posts and content has been better optimized for smaller devices and the toolbar has been simplified so that it only shows 'Favorite', 'Boost', and 'Reply' on mobile. (fixes #4).</p>\n<ul>\n<li>This change also puts the 'View thread' and 'Open in Web' buttons in the menu when on a mobile device.</li>\n</ul>\n</li>\n</ul>","frontmatter":{"title":"What's new in Hyperspace Beta","path":"/docs/whats-new-beta","description":"Read about the latest features, improvements, changes, and bug fixes coming to Hyperspace (currently in beta)."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"pathSlug":"/docs/whats-new-beta"}}